Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Элемент Из Объект.ОтпускаСотрудников Цикл
		Дней = ((НачалоДня(Элемент.ДатаОкончания) - НачалоДня(Элемент.ДатаНачала)) / 86400) + 1;
		
		Если Дней > 0 Тогда
			Элемент.КоличествоДней = Дней;
		КонецЕсли;
	КонецЦикла;
	
	УсловноеФорматирование();
	
КонецПроцедуры

#КонецОбласти	

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Объект.Год = НачалоГода(Объект.Год);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ДанныеСтроки = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Дней = ((НачалоДня(ДанныеСтроки.ДатаОкончания) - НачалоДня(ДанныеСтроки.ДатаНачала)) / 86400) + 1;
	Если Дней > 0 Тогда
		ДанныеСтроки.КоличествоДней = Дней;
	КонецЕсли;
	
	УсловноеФорматирование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ДанныеСтроки = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Дней = ((НачалоДня(ДанныеСтроки.ДатаОкончания) - НачалоДня(ДанныеСтроки.ДатаНачала)) / 86400) + 1;
	Если Дней > 0 Тогда
		ДанныеСтроки.КоличествоДней = Дней;
	КонецЕсли;
	
	УсловноеФорматирование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресДанныхВХранилище = ПоместитьДанныеДокументаВХранилище();
	ПараметрыПодбора = Новый Структура("АдресДанныхДокумента", АдресДанныхВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыПодбора, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УсловноеФорматирование() 
	
	ТабЗнач =  Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, КоличествоДней" );
	ТабЗнач.Свернуть("Сотрудник", "КоличествоДней"); 
	
	УсловноеОформление.Элементы.Очистить();
	
	Для Каждого Колонка ИЗ ТабЗнач Цикл
		Если Колонка.КоличествоДней > 28 Тогда 
			
			МассивИменКолонокДляПодсветки = Новый Массив;
			
			Для каждого Стр из Элементы.ОтпускаСотрудников.ПодчиненныеЭлементы Цикл
				МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
			КонецЦикла;
			
			ЭлементОформления = УсловноеОформление.Элементы.Добавить();
			ЭлементОформления.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
			
			ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
			ЭлементУсловия.ПравоеЗначение = Колонка.Сотрудник;
			ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
			ЭлементУсловия.Использование  = Истина;
			
			Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
				ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
			КонецЦикла; 
			
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеДокументаВХранилище()
	ДанныеДокумента = Новый Структура("Год", Объект.Год);
	ДанныеДокумента.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания"));
	Возврат ПоместитьВоВременноеХранилище(ДанныеДокумента);
КонецФункции
#КонецОбласти
